
"""Queries"""

QUERY_GREETING = "Привет! 👋"
QUERY_BYE = "Выйти"
QUERY_GET_COMPLIMENT = "Скажи приятное 😺"
QUERY_SETTINGS = "Настройки ⚙️"
QUERY_MAIN_MENU = "В главное меню ◀️"
QUERY_TEXT_ANSWER = "Текстовые ответы 🔤"
QUERY_VOICE_ANSWER = "Голосовые ответы 🔊"
QUERY_START_AUTO_COMPLIMENTS = "Включить генератор приятностей 💟"
QUERY_STOP_AUTO_COMPLIMENTS = "Астанавись ❌"


"""Answers"""

ANSWER_GREETING = "Чего желаете? :3"
ANSWER_SETTINGS = "Воть настройки)"
ANSWER_MAIN_MENU = "Воть главная менюшка)"
ANSWER_TEXT_ANSWER = "Оки, буду текстить)"
ANSWER_VOICE_ANSWER = "Оки, буду голосить)"
ANSWER_START_AUTO_COMPLIMENTS = "Включён генератор приятностей :3"
ANSWER_STOP_AUTO_COMPLIMENTS = "Выключен генератор приятностей)"

ANSWER_HI = "Приветствую, госпожа(дин),"
ANSWER_BYE = "Auf fiderzein, госпожа(дин),"
ANSWER_UNDEFINED = "Отправь какую-нибудь фотку с людьми, на этой я их не вижу"

ANSWER_FEMALE = "Похоже, на фотке человек женского пола, лет:"
ANSWER_MALE = "Что ж, случаются ж недоразумения, похоже, на фотке какая-то особь мужского пола, лет"

ANSWER_MALE_WITHOUT_MODEL = "Мой ленивый бог-создатель пока не создал модель, чтобы охарактеризовать это существо, кек"